import React from 'react'
import Image from 'next/image'

export default function CriptoInfo() {

    return (
        <div>
            <section className='max-w-[1140] mx-auto py-12 '>
                <h2 className='text-2xl md:text-3xl  font-extrabold text-gray-900 mx-2 mb-6 '>توضیحات کلی در مورد رمز ارزها</h2>
                <p className='mx-2 text-gray-800 font-semibold mb-6 leading-loose' >رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی را فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت ها کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط ارزهای واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های خاص و صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال خود را با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله اتفاق می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را در حین این انتقال دارا هستند.</p>

                <div className='flex justify-center my-8'>
                    <Image className='md:w-[700] md:h-[400] mx-2 rounded-2xl' src="/Images/RamzArz.png" width={400} height={300} alt='رمزارز'/>
                </div>
                <p className='mx-2 text-gray-800 leading-loose font-semibold mb-6'>رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی را فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت ها کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط ارزهای واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های خاص و صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال خود را با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله اتفاق می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را در حین این انتقال دارا هستند.</p>


            </section>
        </div>
    )
}
